<?php
    header("Content-Type: text/html; charset=utf-8");
    mb_internal_encoding('UTF-8');

    $cityArr = array( "Москва", "Санкт-Петербург", "Волгоград", "Воронеж", "Екатеринбург", "Казань", "Калуга", "Краснодар", "Нижний Новгород", "Новосибирск", "Ростов-на-Дону", "Самара", "Саратов", "Сочи", "Уфа", "Ярославль", "Киев", "Днепр", "Донецк", "Запорожье", "Кривой рог", "Львов", "Одесса", "Харьков", "Минск", "Брест", "Витебск", "Гомель", "Гродно", "Могилев", "Ташкент"
    );

    $result['cityArr'] = $cityArr;


   echo json_encode($result, JSON_UNESCAPED_UNICODE);
?>